<img src="mioti.png" style="height: 100px">
<center style="color:#888">Data Science with Python</center>

# DSPy3. Pandas basics

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Estructuras-de-datos-de-Pandas:-series" data-toc-modified-id="Estructuras-de-datos-de-Pandas:-series-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Estructuras de datos de Pandas: <code>series</code></a></span><ul class="toc-item"><li><span><a href="#Declaraci√≥n-de-series" data-toc-modified-id="Declaraci√≥n-de-series-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Declaraci√≥n de <code>series</code></a></span></li><li><span><a href="#Indexing,-slicing,-ohmy!-üò±" data-toc-modified-id="Indexing,-slicing,-ohmy!-üò±-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Indexing, slicing, ohmy! üò±</a></span></li></ul></li><li><span><a href="#Estructuras-de-datos-de-Pandas:-dataframes" data-toc-modified-id="Estructuras-de-datos-de-Pandas:-dataframes-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Estructuras de datos de Pandas: <code>dataframes</code></a></span><ul class="toc-item"><li><span><a href="#Declaraci√≥n-de-dataframes" data-toc-modified-id="Declaraci√≥n-de-dataframes-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Declaraci√≥n de dataframes</a></span></li><li><span><a href="#Indexing-&amp;-slicing" data-toc-modified-id="Indexing-&amp;-slicing-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Indexing &amp; slicing</a></span></li><li><span><a href="#Masking" data-toc-modified-id="Masking-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Masking</a></span></li></ul></li><li><span><a href="#Ausencia-de-valores" data-toc-modified-id="Ausencia-de-valores-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Ausencia de valores</a></span></li><li><span><a href="#Summary-null-values:" data-toc-modified-id="Summary-null-values:-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Summary null values:</a></span></li></ul></div>

<img src="pandas.png" style="height: 250px; float: left">

Es el paquete de Python que usaremos a lo largo del programa para _data wrangling_ (limpieza y transformaci√≥n de datos) y an√°lisis de datos. 

Pandas trabaja sobre NumPy, lo que significa que est√° orientado a la computaci√≥n vectorial en lugar de al trabajo iterando con bucles.

Sin embargo, la principal diferencia con NumPy es que **Pandas s√≠ que est√° orientado al trabajo con datos en formato tabular heterog√©neos** (de distintos tipos), mientras que los arrays de NumPy est√°n m√°s optimizados a c√°lculos sobre datos num√©ricos homog√©neos.

In [2]:
import pandas as pd

##¬†Estructuras de datos de Pandas: `series`

<img src="series.png" style="height: 150px">

Est√°n implementadas por medio de NumPy arrays, y, como √©stos, tienen un tipo √∫nico de datos:

In [194]:
animals = ["Tigre", "Oso", "Cebra"]
animals = pd.Series(animals)
animals

0    Tigre
1      Oso
2    Cebra
dtype: object

In [195]:
animals.values

array(['Tigre', 'Oso', 'Cebra'], dtype=object)

In [196]:
animals.name = "animals_series"
animals

0    Tigre
1      Oso
2    Cebra
Name: animals_series, dtype: object

In [197]:
animals.dtypes

dtype('O')

In [198]:
animals.index

RangeIndex(start=0, stop=3, step=1)

El √≠ndice no se puede modificar:

In [199]:
# animals.index[0] = 10

In [200]:
numbers = [1, 2, 3]
numbers = pd.Series(numbers)
numbers

0    1
1    2
2    3
dtype: int64

In [201]:
animals_and_numbers = [1, "Tigre", 2]
mix_serie = pd.Series(animals_and_numbers, index = [1, 2, '3'])
mix_serie

1        1
2    Tigre
3        2
dtype: object

In [202]:
mix_serie.dtypes

dtype('O')

Y el √≠ndice:

In [203]:
mix_serie.index

Index([1, 2, '3'], dtype='object')

### Declaraci√≥n de `series`

Dos principales m√©todos:

* Series como diccionarios de Python:

In [204]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}

s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

* Series como 1D arrays de numpy: pd.series(data, index=index)

In [205]:
s = pd.Series(['Tigre', 'Oso', 'Cebra'], index=['India', 'America', 'Canada'])
s

India      Tigre
America      Oso
Canada     Cebra
dtype: object

Si pasamos un diccionario y a la vez especificamos el argumento `index`, intentar√° casar las claves del diccionario con √©ste:

In [206]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}

s = pd.Series(sports, index=['Golf', 'Sumo', 'Hockey'])
s

Golf      Scotland
Sumo         Japan
Hockey         NaN
dtype: object

EJERCICIO: Define un dataframe asignando un √≠ndice y unos valores que tengan sentido, por ejemplo las capitales (valores) de algunos pa√≠ses (√≠ndices.)

In [4]:
capitals = pd.Series({
    'Espa√±a': 'Madrid',
    'Chile': 'Santiago de Chile', 
    'Uruguay': 'Montevideo',
    'Brazil': 'Brasilia',
    'Italia': 'Roma',
})
capitals

Espa√±a                Madrid
Chile      Santiago de Chile
Uruguay           Montevideo
Brazil              Brasilia
Italia                  Roma
dtype: object

Podemos tener √≠ndices repetidos:

In [7]:
s = pd.Series(['Tigre', 'Oso', 'Cebra'], index=['India', 'India', 'Canada'])
s

India     Tigre
India       Oso
Canada    Cebra
dtype: object

In [8]:
s.loc['India']

India    Tigre
India      Oso
dtype: object

### Indexing, slicing, ohmy! üò±

In [9]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}

s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [10]:
s.index

Index(['Archery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

In [11]:
s.values

array(['Bhutan', 'Scotland', 'Japan', 'South Korea'], dtype=object)

Por etiqueta (√≠ndice expl√≠tico):

In [12]:
s.loc['Golf']

'Scotland'

EJERCICIO: Accede a un valor de tu dataframe usando el √≠ndice.

O por posici√≥n (√≠ndice impl√≠cito de numpy):

In [213]:
s.iloc[1]

'Scotland'

# Result

In [13]:
s.index[1]

'Golf'

Si usamos el operador de indexado `[]` directamente, Pandas usar√° internamente `loc` o `iloc` de manera inteligente:

In [15]:
#Como si fuera la key de un diccionario de Python:
s['Golf']

'Scotland'

In [16]:
#Como si fuera el elemento de 1D array de numpy:
s[1]

/var/folders/g9/6x9nn3557t9b869yv8801prr0000gn/T/ipykernel_50788/1436551809.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[1]

'Scotland'

Pero ojo cuidao...

In [17]:
sports = {99: 'Bhutan',
          100: 'Scotland',
          101: 'Japan',
          102: 'South Korea'}
s = pd.Series(sports)
s

99          Bhutan
100       Scotland
101          Japan
102    South Korea
dtype: object

In [ ]:
s[0]  # Da error

Si definimos un √≠ndice num√©rico, Pandas se negar√° a usar directamente el operador de indexado porque no sabr√° si nos referimos a un √≠ndice etiquetado o a un √≠ndice posicional. Para eso se definen los siguientes "indexers":

* Loc: hace referencia al √≠ndice exp√≠cito de la serie
* Iloc: hace referencia al √≠ndicide impl√≠cito de la serie 
* ix: h√≠brido entre Loc e Iloc

In [19]:
s.iloc[0]

'Bhutan'

In [20]:
s.loc[99]

'Bhutan'

Cuidado....

In [21]:
s.iloc[0:1]

99    Bhutan
dtype: object

In [22]:
s.loc[99:100]

99       Bhutan
100    Scotland
dtype: object

<div class="alert alert-block alert-success">
    
**¬øConclusi√≥n? Usad `loc[]` o `iloc[]` siempre en lugar del operador de indexado `[]` directamente**

</div>

## Estructuras de datos de Pandas: `dataframes`

<img src="dataframe.png" style="height: 200px">

###¬†Declaraci√≥n de dataframes

Hay muchas maneras de construir un `dataframe` pero quiz√° la m√°s popular sea la siguiente:

In [222]:
data = {'Cost': [22.5, 2.5, 5.0],
        'Item Purchased': ["Dog Food", "Kitty Litter", "Bird Seed"],
        'Name': ["Chris", "Kevin", "Mike"]}

df = pd.DataFrame(data, index=["Store 1", "Store 1", "Store 2"])
df

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevin
Store 2   5.0      Bird Seed   Mike

Tambien se puede construir un `dataframe` con un diccionario de series

In [223]:
Cost_serie = pd.Series([22.5, 2.5, 5.0],index=["Store 1", "Store 1", "Store 2"])
Item_serie = pd.Series(["Dog Food", "Kitty Litter", "Bird Seed"],index=["Store 1", "Store 1", "Store 2"])
Name_serie = pd.Series(["Chris", "Kevin", "Mike"],index=["Store 1", "Store 1", "Store 2"])

Name_serie

Store 1    Chris
Store 1    Kevin
Store 2     Mike
dtype: object

In [224]:
df = pd.DataFrame({'Cost':Cost_serie, 'Item Purchased':Item_serie,'Name':Name_serie})
df

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevin
Store 2   5.0      Bird Seed   Mike

EJERCICIO: Crea un dataframe de un dominio de tu gusto (e.g. gastos e ingresos de tres restaurantes de una empresa)

# Result:

In [23]:
data = {
    'Product': ['Laptop', 'Smartphone', 'Headphones'],
    'Sales': [2500.00, 800.00, 150.00], 
    'Units_Sold': [5, 10, 20],
    'Customer_Rating': [4.5, 4.2, 4.8]
}

df_retail = pd.DataFrame(data, index=['January', 'February', 'March'])
df_retail

             Product   Sales  Units_Sold  Customer_Rating
January       Laptop  2500.0           5              4.5
February  Smartphone   800.0          10              4.2
March     Headphones   150.0          20              4.8

In [225]:
df.columns

Index(['Cost', 'Item Purchased', 'Name'], dtype='object')

In [226]:
df.index

Index(['Store 1', 'Store 1', 'Store 2'], dtype='object')

Los tipos de datos se informan por colummna:

In [227]:
df.dtypes

Cost              float64
Item Purchased     object
Name               object
dtype: object

Y tambi√©n existe aqu√≠ `shape` como en los arrays de NumPy:

In [228]:
df.shape

(3, 3)

###¬†Indexing & slicing

In [229]:
df

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevin
Store 2   5.0      Bird Seed   Mike

Usamos el operador de indexado con `loc` o `iloc` como en las series, indicando primero fila y luego columna.

In [230]:
df.loc['Store 2', 'Cost']

5.0

In [231]:
df.iloc[2,0]

5.0

No indicar columna equivale a seleccionar todas las columnas:

In [232]:
df.loc['Store 1']

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevin

Que es equivalente a:

In [233]:
df.loc['Store 1', :]

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevin

Para seleccionar todas las filas:

In [234]:
df.loc[:,"Cost"]

Store 1    22.5
Store 1     2.5
Store 2     5.0
Name: Cost, dtype: float64

Una fila de un `DataFrame` es una `Series`:

In [235]:
print(type(df.loc['Store 2']))
df.loc['Store 2']

<class 'pandas.core.series.Series'>

Cost                    5.0
Item Purchased    Bird Seed
Name                   Mike
Name: Store 2, dtype: object

Tambi√©n una columna:

In [236]:
print(type(df.loc[:,'Cost']))
df.loc[:,'Cost']

<class 'pandas.core.series.Series'>

Store 1    22.5
Store 1     2.5
Store 2     5.0
Name: Cost, dtype: float64

Se pueden indicar tanto rangos como listas de filas y columnas:

In [237]:
df.loc['Store 1', ['Cost', 'Name']]

         Cost   Name
Store 1  22.5  Chris
Store 1   2.5  Kevin

In [238]:
df.iloc[0:2, [0, 2]]

         Cost   Name
Store 1  22.5  Chris
Store 1   2.5  Kevin

Si usamos el operador de indexado directamente, Pandas entender√° que nos referimos a las columnas y unicamente podremos acceder por el √≠ndice expl√≠cito:

In [239]:
df['Cost']

Store 1    22.5
Store 1     2.5
Store 2     5.0
Name: Cost, dtype: float64

In [240]:
# df['Store 1'] # Da error

**Ojo cuidao.** Porque si hacemos slicing directamente con el operador de indexado, entonces no entender√° que queremos columnas, sino filas (y aqui si podremos usar tanto el expl√≠cito como el implicito):

In [241]:
df[0:2]

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevin

In [242]:
df['Store 1':'Store 2']

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevin
Store 2   5.0      Bird Seed   Mike

<div class="alert alert-block alert-success">
    
**¬øConclusi√≥n? Usad `loc[]` o `iloc[]` siempre en lugar del operador de indexado `[]` directamente**

</div>

A√±adir filas o columnas es tan f√°cil como acceder a esas filas / columnas que no existen y darles valor:

In [243]:
df

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevin
Store 2   5.0      Bird Seed   Mike

In [244]:
df["Units"] = [3,4,6]
df

         Cost Item Purchased   Name  Units
Store 1  22.5       Dog Food  Chris      3
Store 1   2.5   Kitty Litter  Kevin      4
Store 2   5.0      Bird Seed   Mike      6

In [245]:
df.dtypes

Cost              float64
Item Purchased     object
Name               object
Units               int64
dtype: object

In [246]:
df.loc["Store 3"] = [3, "Cat Food", "Pepe", '2']

In [247]:
df

         Cost Item Purchased   Name Units
Store 1  22.5       Dog Food  Chris     3
Store 1   2.5   Kitty Litter  Kevin     4
Store 2   5.0      Bird Seed   Mike     6
Store 3   3.0       Cat Food   Pepe     2

In [248]:
df.dtypes

Cost              float64
Item Purchased     object
Name               object
Units              object
dtype: object

### Masking

In [26]:
#Leemos un DataFrame externo:
df = pd.read_csv('olympics.csv', index_col = 0)
df.head()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan¬†(AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria¬†(ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina¬†(ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia¬†(ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia¬†(ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

¬øQu√© paises han ganado al menos una medalla de oro en alg√∫n juego de verano?

In [31]:
df['Gold'] > 0

Afghanistan¬†(AFG)                               False
Algeria¬†(ALG)                                    True
Argentina¬†(ARG)                                  True
Armenia¬†(ARM)                                    True
Australasia¬†(ANZ) [ANZ]                          True
                                                ...
Independent Olympic Participants¬†(IOP) [IOP]    False
Zambia¬†(ZAM) [ZAM]                              False
Zimbabwe¬†(ZIM) [ZIM]                             True
Mixed team¬†(ZZX) [ZZX]                           True
Totals                                           True
Name: Gold, Length: 147, dtype: bool

In [37]:
countries_with_gold_in_summer = df[df['Gold'] > 0]
countries_with_gold_in_summer.head(5)

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Algeria¬†(ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina¬†(ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia¬†(ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia¬†(ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
Australia¬†(AUS) [AUS] [Z],25,139,152,177,468,18,5,3,4,12,43,144,155,181,480

Adivinanza......

In [39]:
countries_with_gold_in_summer.iloc[0,0] = 1000

/var/folders/g9/6x9nn3557t9b869yv8801prr0000gn/T/ipykernel_50788/4013495851.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  countries_with_gold_in_summer.iloc[0,0] = 1000

In [40]:
countries_with_gold_in_summer.head(10)

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Algeria¬†(ALG),1000,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina¬†(ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia¬†(ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia¬†(ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
Australia¬†(AUS) [AUS] [Z],25,139,152,177,468,18,5,3,4,12,43,144,155,181,480
Austria¬†(AUT),26,18,33,35,86,22,59,78,81,218,48,77,111,116,304
Azerbaijan¬†(AZE),5,6,5,15,26,5,0,0,0,0,10,6,5,15,26
Bahamas¬†(BAH),15,5,2,5,12,0,0,0,0,0,15,5,2,5,12
Belarus¬†(BLR),5,12,24,39,75,6,6,4,5,15,11,18,28,44,90
Belgium¬†(BEL),25,37,52,53,142,20,1,1,3,5,45,38,53,56,147

In [41]:
df.head(10)

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan¬†(AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria¬†(ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina¬†(ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia¬†(ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia¬†(ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
Australia¬†(AUS) [AUS] [Z],25,139,152,177,468,18,5,3,4,12,43,144,155,181,480
Austria¬†(AUT),26,18,33,35,86,22,59,78,81,218,48,77,111,116,304
Azerbaijan¬†(AZE),5,6,5,15,26,5,0,0,0,0,10,6,5,15,26
Bahamas¬†(BAH),15,5,2,5,12,0,0,0,0,0,15,5,2,5,12
Bahrain¬†(BRN),8,0,0,1,1,0,0,0,0,0,8,0,0,1,1

¬øQu√© pa√≠ses han ganado alguna medalla de oro en invierno y ninguna en verano?

In [42]:
df[(df['Gold.1'] > 0) & (df['Gold'] == 0)]

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Liechtenstein¬†(LIE),16,0,0,0,0,18,2,2,5,9,34,2,2,5,9

Tambi√©n podemos seleccionar todos los valores de un DataFrame que cumplen una condici√≥n:

In [43]:
df.head(5)

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan¬†(AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria¬†(ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina¬†(ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia¬†(ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia¬†(ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

Por ejemplo, seleccionar todos aquellos valores iguales a cero. Esto ser√≠a la "m√°scara booleana":

In [44]:
(df == 0).head(5)

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan¬†(AFG),False,True,True,False,False,True,True,True,True,True,False,True,True,False,False
Algeria¬†(ALG),False,False,False,False,False,False,True,True,True,True,False,False,False,False,False
Argentina¬†(ARG),False,False,False,False,False,False,True,True,True,True,False,False,False,False,False
Armenia¬†(ARM),False,False,False,False,False,False,True,True,True,True,False,False,False,False,False
Australasia¬†(ANZ) [ANZ],False,False,False,False,False,True,True,True,True,True,False,False,False,False,False

Que al usarla sobre el dataframe, nos deja lo siguiente:

In [45]:
(df[df > 0]).head(5) # Los valores en cuesti√≥n toman "NaN"

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan¬†(AFG),13,NaN,NaN,2.0,2.0,NaN,NaN,NaN,NaN,NaN,13,NaN,NaN,2.0,2
Algeria¬†(ALG),12,5.0,2.0,8.0,15.0,3.0,NaN,NaN,NaN,NaN,15,5.0,2.0,8.0,15
Argentina¬†(ARG),23,18.0,24.0,28.0,70.0,18.0,NaN,NaN,NaN,NaN,41,18.0,24.0,28.0,70
Armenia¬†(ARM),5,1.0,2.0,9.0,12.0,6.0,NaN,NaN,NaN,NaN,11,1.0,2.0,9.0,12
Australasia¬†(ANZ) [ANZ],2,3.0,4.0,5.0,12.0,NaN,NaN,NaN,NaN,NaN,2,3.0,4.0,5.0,12

Podr√≠amos sustituirlos por otra cosa:

In [46]:
df_modified = df.copy()
df_modified[df_modified == 0] = "Zero"
df_modified.head(20)

/var/folders/g9/6x9nn3557t9b869yv8801prr0000gn/T/ipykernel_50788/2017034549.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Zero' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df_modified[df_modified == 0] = "Zero"

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan¬†(AFG),13,Zero,Zero,2,2,Zero,Zero,Zero,Zero,Zero,13,Zero,Zero,2,2
Algeria¬†(ALG),12,5,2,8,15,3,Zero,Zero,Zero,Zero,15,5,2,8,15
Argentina¬†(ARG),23,18,24,28,70,18,Zero,Zero,Zero,Zero,41,18,24,28,70
Armenia¬†(ARM),5,1,2,9,12,6,Zero,Zero,Zero,Zero,11,1,2,9,12
Australasia¬†(ANZ) [ANZ],2,3,4,5,12,Zero,Zero,Zero,Zero,Zero,2,3,4,5,12
Australia¬†(AUS) [AUS] [Z],25,139,152,177,468,18,5,3,4,12,43,144,155,181,480
Austria¬†(AUT),26,18,33,35,86,22,59,78,81,218,48,77,111,116,304
Azerbaijan¬†(AZE),5,6,5,15,26,5,Zero,Zero,Zero,Zero,10,6,5,15,26
Bahamas¬†(BAH),15,5,2,5,12,Zero,Zero,Zero,Zero,Zero,15,5,2,5,12
Bahrain¬†(BRN),8,Zero,Zero,1,1,Zero,Zero,Zero,Zero,Zero,8,Zero,Zero,1,1
Barbados¬†(BAR) [BAR],11,Zero,Zero,1,1,Zero,Zero,Zero,Zero,Zero,11,Zero,Zero,1,1
Belarus¬†(BLR),5,12,24,39,75,6,6,4,5,15,11,18,28,44,90
Belgium¬†(BEL),25,37,52,53,142,20,1,1,3,5,45,38,53,56,147
Bermuda¬†(BER),17,Zero,Zero,1,1,7,Zero,Zero,Zero,Zero,24,Zero,Zero,1,1
Bohemia¬†(BOH) [BOH] [Z],3,Zero,1,3,4,Zero,Zero,Zero,Zero,Zero,3,Zero,1,3,4
Botswana¬†(BOT),9,Zero,1,Zero,1,Zero,Zero,Zero,Zero,Zero,9,Zero,1,Zero,1
Brazil¬†(BRA),21,23,30,55,108,7,Zero,Zero,Zero,Zero,28,23,30,55,108
British West Indies¬†(BWI) [BWI],1,Zero,Zero,2,2,Zero,Zero,Zero,Zero,Zero,1,Zero,Zero,2,2
Bulgaria¬†(BUL) [H],19,51,85,78,214,19,1,2,3,6,38,52,87,81,220
Burundi¬†(BDI),5,1,Zero,Zero,1,Zero,Zero,Zero,Zero,Zero,5,1,Zero,Zero,1

Podr√≠amos, por ejemplo, eliminar del dataframe todos aquellos registros que tengan al menos un valor en 0:

In [47]:
df = df[df != 0]
df.head(5)

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan¬†(AFG),13,NaN,NaN,2.0,2.0,NaN,NaN,NaN,NaN,NaN,13,NaN,NaN,2.0,2
Algeria¬†(ALG),12,5.0,2.0,8.0,15.0,3.0,NaN,NaN,NaN,NaN,15,5.0,2.0,8.0,15
Argentina¬†(ARG),23,18.0,24.0,28.0,70.0,18.0,NaN,NaN,NaN,NaN,41,18.0,24.0,28.0,70
Armenia¬†(ARM),5,1.0,2.0,9.0,12.0,6.0,NaN,NaN,NaN,NaN,11,1.0,2.0,9.0,12
Australasia¬†(ANZ) [ANZ],2,3.0,4.0,5.0,12.0,NaN,NaN,NaN,NaN,NaN,2,3.0,4.0,5.0,12

In [48]:
df = df.dropna()
df.head(5)

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Australia¬†(AUS) [AUS] [Z],25,139.0,152.0,177.0,468.0,18.0,5.0,3.0,4.0,12.0,43,144.0,155.0,181.0,480
Austria¬†(AUT),26,18.0,33.0,35.0,86.0,22.0,59.0,78.0,81.0,218.0,48,77.0,111.0,116.0,304
Belarus¬†(BLR),5,12.0,24.0,39.0,75.0,6.0,6.0,4.0,5.0,15.0,11,18.0,28.0,44.0,90
Belgium¬†(BEL),25,37.0,52.0,53.0,142.0,20.0,1.0,1.0,3.0,5.0,45,38.0,53.0,56.0,147
Bulgaria¬†(BUL) [H],19,51.0,85.0,78.0,214.0,19.0,1.0,2.0,3.0,6.0,38,52.0,87.0,81.0,220

In [262]:
help(df.dropna)

Help on method dropna in module pandas.core.frame:

dropna(*, axis: 'Axis' = 0, how: 'AnyAll | NoDefault' = <no_default>, thresh: 'int | NoDefault' = <no_default>, subset: 'IndexLabel' = None, inplace: 'bool' = False, ignore_index: 'bool' = False) -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Remove missing values.

    See the :ref:`User Guide <missing_data>` for more on which values are
    considered missing, and how to work with missing data.

    Parameters
    ----------
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Determine if rows or columns which contain missing values are
        removed.

        * 0, or 'index' : Drop rows which contain missing values.
        * 1, or 'columns' : Drop columns which contain missing value.

        Pass tuple or list to drop on multiple axes.
        Only a single axis is allowed.

    how : {'any', 'all'}, default 'any'
        Determine if row or column is removed from DataFrame, when we have
        at least one NA or all NA.

        * 'any' : If any NA values are present, drop that row or column.
        * 'all' : If all values are NA, drop that row or column.

    thresh : int, optional
        Require that many non-NA values. Cannot be combined with how.
    subset : column label or sequence of labels, optional
        Labels along other axis to consider, e.g. if you are dropping rows
        these would be a list of columns to include.
    inplace : bool, default False
        Whether to modify the DataFrame rather than creating a new one.
    ignore_index : bool, default ``False``
        If ``True``, the resulting axis will be labeled 0, 1, ‚Ä¶, n - 1.

        .. versionadded:: 2.0.0

    Returns
    -------
    DataFrame or None
        DataFrame with NA entries dropped from it or None if ``inplace=True``.

    See Also
    --------
    DataFrame.isna: Indicate missing values.
    DataFrame.notna : Indicate existing (non-missing) values.
    DataFrame.fillna : Replace missing values.
    Series.dropna : Drop missing values.
    Index.dropna : Drop missing indices.

    Examples
    --------
    >>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
    ...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
    ...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
    ...                             pd.NaT]})
    >>> df
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Drop the rows where at least one element is missing.

    >>> df.dropna()
         name        toy       born
    1  Batman  Batmobile 1940-04-25

    Drop the columns where at least one element is missing.

    >>> df.dropna(axis='columns')
           name
    0    Alfred
    1    Batman
    2  Catwoman

    Drop the rows where all elements are missing.

    >>> df.dropna(how='all')
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Keep only the rows with at least 2 non-NA values.

    >>> df.dropna(thresh=2)
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Define in which columns to look for missing values.

    >>> df.dropna(subset=['name', 'toy'])
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

## Ausencia de valores

En Python, `None` es un objeto que representa la ausencia de valor (como "null" en otros lenguajes):

In [263]:
animals = ['Tigre', 'Oso', None]
animals

['Tigre', 'Oso', None]

Pandas puede trabajar con los None:

In [264]:
pd.Series(animals)

0    Tigre
1      Oso
2     None
dtype: object

NumPy y Pandas, en cambio, para valores numericos cambiar√°n ese `None` por `NaN` ("Not a Number"). A diferencia de `None`, que ser√≠a de tipo `object`, NaN es un valor especial que est√° definido como un n√∫mero en coma flotante ("float"), lo cual es interesante por razones de eficiencia computacional.

In [265]:
numbers = [1, 2, None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

**Pregunta:** ¬øQu√© devolvera el siguiente c√≥digo?

In [266]:
None == None

True

Entonces... ?

In [267]:
animals = ['Tigre', 'Oso', None]
animals = [x for x in animals if x == None]
animals

[None]

Entonces... ?

In [268]:
animals = pd.Series(['Tigre', 'Oso', None])
animals[animals == None]

Series([], dtype: object)

**Pregunta:** ¬øQu√© devolver√° el siguiente c√≥digo?

In [269]:
import numpy as np
np.nan == np.nan

False

Para evitar caer en este sindios, Pandas ofrece la funci√≥n de conveniencia `isna`, que tiene en cuenta todo:

In [270]:
animals = pd.Series(['Tigre', 'Oso', None, np.nan])
animals

0    Tigre
1      Oso
2     None
3      NaN
dtype: object

In [271]:
animals.isna()

0    False
1    False
2     True
3     True
dtype: bool

In [272]:
animals.isnull()

0    False
1    False
2     True
3     True
dtype: bool

BUT...

In [273]:
animals = pd.Series(['Tigre', 'Oso', None, np.nan, np.inf])
animals

0    Tigre
1      Oso
2     None
3      NaN
4      inf
dtype: object

In [274]:
animals.isna()

0    False
1    False
2     True
3     True
4    False
dtype: bool

Ademas ...

In [275]:
animals = pd.Series(['Tigre', 'Oso', None, np.nan, np.inf, ""])
animals

0    Tigre
1      Oso
2     None
3      NaN
4      inf
5
dtype: object

In [276]:
animals.isna()

0    False
1    False
2     True
3     True
4    False
5    False
dtype: bool

## Summary null values:

* Python list:

In [277]:
import math
lista_1=[1,2,3,None]
print(lista_1)
[x==None for x in lista_1]

[1, 2, 3, None]

[False, False, False, True]

In [278]:
import math
lista_1=[1,2,3,np.nan]
print(lista_1)
[np.isnan(x) for x in lista_1]
#or:
#[math.isnan(x) for x in lista_1]

[1, 2, 3, nan]

[False, False, False, True]

* Numpy arrays:

In [279]:
#Array
array=np.array([1,2,3,None])
print(array)
array == None

[1 2 3 None]

array([False, False, False,  True])

Cuidado con los None en los arrays de numpy:

In [280]:
# array.sum()  # Da error

In [281]:
#Array con enteros
array=np.array([1,2,3,np.nan])
print(array)
np.isnan(array)

[ 1.  2.  3. nan]

array([False, False, False,  True])

In [282]:
array.sum()

nan

In [283]:
np.nansum(array)

6.0

In [284]:
#Array con strings
array=np.array(['1','2','3',np.nan])
print(array)
array == 'nan'

['1' '2' '3' 'nan']

array([False, False, False,  True])

* Pandas objects:

In [285]:
#Serie con enteros
serie=pd.Series([1,2,np.nan,None])
print(serie)
serie.isnull()

0    1.0
1    2.0
2    NaN
3    NaN
dtype: float64

0    False
1    False
2     True
3     True
dtype: bool

In [286]:
#Serie con strings
serie=pd.Series(['1','2',np.nan,None])
print(serie)
serie.isnull()

0       1
1       2
2     NaN
3    None
dtype: object

0    False
1    False
2     True
3     True
dtype: bool